{
  "brand": {
    "slug": "clickup",
    "name": "ClickUp",
    "name_variations": ["ClickUp", "clickup", "Clickup"],
    "preferred_casing": {
      "clickup": 0.50,
      "Clickup": 0.50
    },
    "global_banned_words": [
      "check out", "link in bio", "highly recommend", "game changer",
      "must have", "you should try", "sign up", "use code", "discount",
      "promo", "sponsored", "ad ", "partner", "affiliate", "free trial",
      "download now", "available now", "don't miss", "limited time",
      "click the link", "go to", "visit", "coupon", "offer"
    ]
  },

  "templates": {
    "productivity": {
      "slug": "productivity",
      "name": "Productivity / Research-Backed Tips",
      "brand_slug": "clickup",

      "theme_story": "The productivity template creates 5-slide TikTok carousels built around research-backed productivity tips — NOT product marketing. The authority comes from DATA and RESEARCH, not personal experience or emotion. Slide 1 is a hook that borrows credibility from research or people: 'I interviewed 30 founders about productivity' or 'A CEO I shadowed does 3x my output in half my time' — always includes specific numbers. Slide 2 delivers the actual productivity tip as a broad, actionable principle. Slide 3 shows the problem — what most people do wrong, may mention competitors like Asana, Notion, Slack. Slide 4 introduces ClickUp nonchalantly as the tool productive people happen to use — scenery, never a pitch. Slide 5 is a soft follow CTA with ZERO ClickUp mention.",

      "commenting_persona": "You are someone who watches productivity content on TikTok and this carousel confirmed what you suspected or showed you something that clicked. Three types: (1) THE CONVERT — using inferior tools and this made you realize how behind you are. (2) THE INSIDER — already use ClickUp and watching everyone catch up. Smug, validated. (3) THE DATA FAN — latch onto specific numbers or research and amplify them. Tone: confident, data-aware, slightly cocky, internet-casual.",

      "brand_mention_strategy": "always",

      "relevance_ratio": 0.55,

      "archetype_weights": {
        "hype_validation": 0.25,
        "situational_react": 0.20,
        "impulsive_action": 0.15,
        "comparative_real": 0.15,
        "social_sharing": 0.10,
        "personal_testimony": 0.08,
        "curiosity_question": 0.07,
        "feigned_ignorance": 0.00
      },

      "archetype_guidance": {
        "hype_validation": {
          "description": "Impressed by ClickUp's VALUE — it's free, replaces 3 tools, cleaner than anything else. Your comment is a confident hot take. Three flavors: value hype, superiority hype, social proof hype.",
          "style_notes": "Confident, cocky. 'ok but clickup being free while doing all this is wild' energy. One clean line. Never a compound 'and' sentence."
        },
        "situational_react": {
          "description": "React to a data point, research finding, or tip from the post. Echo something specific you learned and connect it to ClickUp.",
          "style_notes": "References RESEARCH DATA, not roles or emotions. 'say lessss' and similar internet slang. One thought."
        },
        "impulsive_action": {
          "description": "The productivity data convinced you to switch. Rational-but-urgent realization that you're wasting time. Self-deprecating humor about your failures.",
          "style_notes": "Urgency is RATIONAL not emotional. No 1am/2am references. Humor from admitting productivity failures. One thought."
        },
        "comparative_real": {
          "description": "Comparing your inferior setup to ClickUp. Competitors named in the post are ammunition for self-deprecation.",
          "style_notes": "Strongest in productivity because content shows 'what most people do wrong'. Admit you ARE the 'most people'. Self-deprecation about workflow, never relationships."
        },
        "social_sharing": {
          "description": "Share this productivity insight or find someone to try ClickUp with. Collaborative, not desperate.",
          "style_notes": "Tag a colleague, teammate, boss — not family. 'sending this to my team lead who still thinks spreadsheets are fine' energy."
        },
        "personal_testimony": {
          "description": "Already use ClickUp and the post validates your choice. You feel vindicated.",
          "style_notes": "Low weight. Vindicated tone — 'I already knew this' energy. One sentence."
        },
        "curiosity_question": {
          "description": "Genuine question about ClickUp's capabilities triggered by a claim in the post.",
          "style_notes": "Rare. Technical/capability question, not emotional."
        }
      },

      "golden_comments": [
        "ok but clickup being free while helping you charge 40% more is wild",
        "I need clickup just to stop gaslighting myself into thinking I do nothing",
        "38 out of 50 said it's tracked in clickup say lessss",
        "ok who wants to be my clickup accountability partner because I NEED this",
        "I've been planning in google sheets like a caveman I think it's time to try clickup",
        "this is why clickup is built different no other tool does this this clean",
        "30 EAs can't be wrong clickup ftw ig",
        "that's so smart templates workflows all in clickup before you even need them"
      ],

      "anti_examples": [
        {"text": "ClickUp gave me my mornings back and my creativity feels so good", "reason": "compound 'and' sentence, vague second clause, too polished"},
        {"text": "the X part actually broke me and now I need ClickUp", "reason": "formulaic slot-fill AI pattern"},
        {"text": "I literally felt that. ClickUp is the move", "reason": "two sentences with mid-period, over-structured"}
      ],

      "banned_patterns": [
        "actually broke me",
        "and now I need",
        "feels so good"
      ],

      "comment_rules": {
        "word_count_range": [6, 18],
        "always_mention_brand": true,
        "no_emojis": true,
        "no_hashtags": true,
        "no_trailing_punctuation": true,
        "allowed_slang": ["lol", "ngl", "tbh", "fr", "rn", "lowkey", "ok but", "ftw", "ig", "say less", "bruh"],
        "slang_frequency": "natural",
        "case_style": "Mixed. Many start lowercase. Internet-casual capitalization — not sloppy, just relaxed.",
        "tone": "Confident, data-aware, slightly cocky, impressed. Three modes: (1) impressed by value/capability, (2) self-deprecating about inferior setup, (3) amplifying social proof from post data. Never emotional, never desperate."
      },

      "content_structure_hint": "Posts are research-backed 5-slide productivity carousels. Content may include: research_hook, productivity_tip, common_mistake (may reference competitors), clickup_mention (nonchalant), caption. The pipeline does not depend on these exact field names."
    }
  }
}
